# AutoJoinConditionWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AutoJoinConditionWall Property
ParameterTypeId Class See Also
---
"Join Condition"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AutoJoinConditionWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AutoJoinConditionWall As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AutoJoinConditionWall {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace